{ "sessions":[
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "initOS GmbH / Otto-von-Guericke University Magdeburg",
        "id": 1,
        "name": "Frederik Kramer"
      }
    ],
    "description": "Die Erfindung und Verbreitung des Internet hat die Welt enger zusammenrücken lassen. Längst ist aus einem einst lokalen, regionalen oder bestenfalls nationalen Wettbewerb ein globaler Wettbewerb geworden. Stetig fallende Kosten der Informationsverarbeitung durch intensive Vernetzung und Erweiterung der Übertragungsbandbreiten sorgt dafür, dass die gespeicherte Informationsmenge rasant wächst.  Sie wächst dabei erheblich schneller als die Weltbevölkerung bzw. die Anzahl verfügbarer Fachkräfte, die sich mit den technischen  Lösungen der Informationsverarbeitung befassen. Die Informationstechnologiebranche ist diejenige Branche, die sich stellvertretend für alle anderen Branchen mit den technologischen Anforderungen der Informations- und Wissensverarbeitung auseinandersetzt. Daneben erzeugt und verarbeitet sie selbst im Rahmen ihrer Leistungserbringung große Mengen komplexen Wissens. Im Maschinenraum der Informationstechnologiebranche planen, entwickeln, betreiben und warten Softwareentwickler, Tester, Administratoren und Projektmanager, Software, deren Erstellung auf Grund fachlicher Anforderungen bzw. eines entsprechenden Marktpotentials notwendig oder sinnvoll erscheint.  Was inbesondere in den 1990er Jahren noch als verrückt galt, nämlich Wissen in Form von Quellcode uns selbst ganze, komplexe Anwendungssysteme zu explizieren und für jedermann zugänglich und nutzbar zu teilen (Open Source bzw. Free Software), hat zusammen mit dem Erfolg prominenter Projekte (z.B. Linux, LibreOffice, Firefox) und dem Ausbau weltweiter Kommunikationsnetze eine globale Erfolgsgeschichte geschrieben. Bis vor wenigen Jahren hielten die meisten Fachleute es für undenkbar, dass auch grundlegenste betriebliche Anwendungen, sogenannte Enterprise Resource Planning Systeme in diesem Modus entwickelt und betrieben werden können. U.a. das Open Source ERP-System Odoo tritt seit geraumer Zeit den Gegenbeweis an. Um den belgischen Hersteller haben sich in den vergangenen Jahren mehrere hundert Integrationspartner weltweit und eine Gruppe von über 2 Mio. aktive Nutzer in einer Community formiert. Der Vortrag fast die seit 2008 andauernde Entwicklung von Odoo (zuvor als OpenERP bekannt) aus Sicht eines Integrationspartners zusammen und stellt dabei die Rolle des Wissensaustausches, ökonomischer Interessen des Herstellers und der Integrationspartner sowie Erfolgs- und Risikofaktoren eines weltweit erfolgreichen Open Source Projektes am Beispiel dar. Insbesondere wird dabei auch auf den erkennbaren Trend der Professionalisierung erfolgreicher Open Source Projekte und Dual Licensing eingegangen. ",
    "title": "Die Rolle von Wissen, ökonomischer Faktoren und Professionalisierung in erfolgreichen Open Source Projekten am Beispiel von Odoo",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 15437,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Askemos",
        "id": 2,
        "name": "Jörg Wittenberger"
      }
    ],
    "description": "Modellierung von rechtlichen Prozessen.  Anforderungen und Lösungsansätze im Vergleich.",
    "title": "smart contracts [th]at work",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 66826,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Mozilla",
        "id": 3,
        "name": "Elio Qoshi"
      }
    ],
    "description": "In early 2016, we started the Community Design initative at Mozilla, allowing all volunteer contributors to work closer with staff and get involved in projects, which before were accessible only to staff at Mozilla. This caters the needs of both community and staff, in a decentralized way.",
    "title": "Community Design at Mozilla  ",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 67661,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Wikimedia Deutschland e.V.",
        "id": 4,
        "name": "Marius Hoch"
      }
    ],
    "description": "Wikidata is a repository of free knowledge in a structured form that contains pieces of information about everything on Wikipedia and more such as number of inhabitants of a country, geodata, historical dates, and others.  It is a free knowledge base that can be edited by humans and machines  alike and powers Wikimedia projects such as Wikipedia.  The Wikidata Query Service allows everyone to tap into this data and query information with SPARQL, find out relationships, and create beautiful visualizations.",
    "title": "Mining the knowledge of the world with Wikidata",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 6561,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Endocode AG",
        "id": 5,
        "name": "Thomas Fricke"
      }
    ],
    "description": "It does not make sense to mourn about clouds just being other peoples computers. With Kubernetes (k8s) and Docker you can easily create your own public cloud running on your cloud providers computers, or with a little more effort,  your own *private* cloud running on or your *own* hardware.  There has been evolved an entire ecosystem for software deployed in  containers and for software components securing privacy in the k8s cloud.  With CoreOS as an immutable operating system running immutable containers you could get a higher integrity level build in your application by design.",
    "title": "Creating Service Clouds with Kubernetes, CoreOS, Container and Co ",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 26073,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Wikimedia Deutschland",
        "id": 6,
        "name": "Barbara Fischer"
      }
    ],
    "description": "GLAMorous Importer wanted: More and more art & culture heritage keeping institutions as galleries, libraries archives or museums, aka GLAM, make large quantities of their collections accessible to further reuse. Often enough the content would be easier to reuse for apps and augmented reality if transferred to Wikimedia Commons. The talk intends to spur initiatives to transfer open data of the GLAMorous kind to Wikimedia Commons. It shows the opportunities, the hurdles and provides hints where to start. It is not a technical instruction how to do it, but a call for action to start to do it.",
    "title": "GLAMorous Importer wanted",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 93605,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Jugend Hackt",
        "id": 7,
        "name": "Jakob Schade"
      }
    ],
    "description": "Auch 2015 konnten junge Hacker_innen bei Jugend Hackt zeigen, wie sie mit Code die Welt verbessern. In 5 Events mit fast 300 Teilnehmenden und über 50 entstandenen Projekten gab es eine Vielzahl an spannenden, lustigen und auch wegweisenden Ideen und Prototypen, wie die Junghacker_innen ihre Fähigkeiten für eine positive Gesellschaft einsetzen. Einige dieser Projekte werden hier vorgestellt und können mit den jungen Entwicklern selbst diskutiert werden. Jugend Hackt ist ein Hackathon für Jugendliche zwischen 12 und 18 Jahren, welcher seit 2013 von der Open Knowledge Foundation veranstaltet wird.",
    "title": "Jugend Hackt",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 85787,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Code for Berlin",
        "id": 8,
        "name": "Thomas Tursics"
      }
    ],
    "description": "Nach einer kurzen Einleitung, was Open Data ist, schauen wir gemeinsam in mehrere Open Data Portale hinein. Welche Daten werden angeboten, wie kann man sie sich anschauen und was daraus schlußfolgern? Unterfüttert mit jede Menge Anwendungsbeispielen aus der Community und Ergebnissen von Hackathons soll die Lust auf Open Data geweckt werden.",
    "title": "Open Data für Dummies - oder - Wie nutze ich offene Daten",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 47342,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "OTS",
        "id": 9,
        "name": "OTS Panelists"
      }
    ],
    "description": "Technology and Society Panel",
    "title": "Open Technology and Society Panel",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 17376,
    "location": "a",
    "type": "Panel"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Beuth Hochschule fuer Technik Berlin",
        "id": 10,
        "name": "Ruediger/Bruno Weis/Kirschner"
      }
    ],
    "description": "Authenticated Anonymity by Math Ruediger Weis, Bruno Kirschner  Number theory provides us many tools to create sometimes really surprising technologies for social communication. We have learned that math might be our last defence line against a real existing all-encompassing surveillance. One central challenge in this conflict is to combine authentication and anonymity. Since a lot of these technologies have not been brought to the implemented world yet, we want to present a proposal to integrate blind signature schemes over elliptic curves into Open PGP. ",
    "title": "Authenticated Anonymity by Math",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 99085,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Open Source Circular Economy Days ",
        "id": 11,
        "name": "Lars Zimmermann"
      }
    ],
    "description": "Open Source Circular Design is so ugly! Is it? Or is it just a new paradigm for design we are going to explore? Funnier, sexier, more elegant ... that was yesterday (or is today). But in the future maybe it will be modular, hackable, reusable and open ...  This talk will be a reading of a letter exchange that happened between a guy that is a critic of open design and loves shiny apple stuff and a guy that tries to explore open source circular design. The letter exchanges brings up the key arguments of both sides. | It mentions and works in the context of the Open Source Circular Economy Days",
    "title": "Open Source Circular Design is so Ugly! / Open Source Circular Design ist unglaublich hässlich!",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 2248,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "OpenKnowledge",
        "id": 12,
        "name": "Rufus Pollock"
      }
    ],
    "description": "If you have ever been online, watched a movie or taken a medicine you have been a user of information. Today information in the form of software, databases and innovations is becoming more important than ever before. Information is becoming main thing we make, trade and use.  This is a new world being built on \"bits\". Its virtual nature makes it different from the physical world of bread and land and cars which can only have one user at a time. By contrast, information can be used by many at the same time.  The implications of this are huge. It makes a world of open information both possible and desirable -- that is a world in which all public information can be openly and freely used, shared and built on. This is a world where no-one is denied access to life-saving medicines because of cost, where everyone has access to our cultural heritage, where artists, innovators and creators are paid more and more fairly.  But getting there will not be easy. Dystopia is the default: if we do nothing we will get a world of exclusion and control where information is made to play by the same rules as our old physical one using \"intellectual property\" monopoly rights like copyright and patents.  In this talk we will explore the road ahead and explain why we can and must create an open future. The talk is for anyone interested in the coming information age and its implications for the politics, law and economics of this next century.",
    "title": "Making an Open Information Age",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 3345,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Code Week Award",
        "id": 13,
        "name": "Code Week Award"
      }
    ],
    "description": "Matthias und Nora vom Code Week Team stellen den Code Week Award vor und zeigen einen Live-Hack. Wir programmieren ein Computerspiel in nur 15 Minuten und spielen mit euch. Wer gewinnt, bekommt von uns einen Überraschungs-Preis.  Unter dem Motto “Jede Woche ist Code Week” fördert der Code Week Award spielerische und kreative Workshop-Formate und digitale Kompetenzen bei Kindern und Jugendlichen in ganz Deutschland. Der Award wurde anknüpfend an den Erfolg der EU Code Week im Oktober 2014 erstmalig von der Technologiestiftung Berlin und dem Design Research Lab der Universität der Künste Berlin ausgeschrieben und durch die Unterstützung von Samsung ins Leben gerufen. 2016 findet bereits die zweite Ausgabe des Awards statt, der in den vergangenen beiden Jahren bereits hunderte Kindern und Jugendlichen einen kreativen Umgang mit digitalen Technologien ermöglicht hat. ",
    "title": "Code Week Award Live-Hack",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 91108,
    "location": "a",
    "type": "Talk mit Live-Hack (20 Minuten)"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "FreeGeo API",
        "id": 14,
        "name": "Zac Brown"
      }
    ],
    "description": "Open technologies play a very important role in advancing some of the most empowering technologies of today. Explore that role, specifically pertaining to Geospatial data and the FreeGeo API, and discover how you can help advance the technology and availability of geospatial mapping and other services. ",
    "title": "Open Data: Geospatial Heaven",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 45946,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "unabhängig",
        "id": 15,
        "name": "Felicitas Blanck"
      }
    ],
    "description": "Sind die Kommentare noch zu retten? Wie lässt man Nutzer im Internet am besten zu Wort kommen? Und wie kommen wir dabei zu einer sachlicheren Debatte? Nutzerkommentare sind sprichwörtliches Reservoir für Hass und Beleidigungen. Viele Nachrichtenportale und Blogs haben inzwischen ihre Kommentarbereiche geschlossen oder stark eingeschränkt.  Ist das wirklich der Weisheit letzter Schluss? Immer wieder gibt es Versuche, durch die Anpassung der Nutzeroberfläche und Hürden bei der Anmeldung zu einer sachlicheren Debatte zu kommen. Was gibt es für Ansätze? Sind diese erfolgreich? Und was ",
    "title": "Nutzerkommentare im Internet",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 5176,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Makeomnia Ltd / HKCOTA",
        "id": 16,
        "name": "Alvin Lui"
      }
    ],
    "description": "TinyBoy Project is an education project started at 2011. The talk is about the follow up of the project, what we did and the progress.  To show the new version of the TinyBoy, TinyBoy2. And to discuss about how to integrate into STEAM.",
    "title": "TinyBoy Project - a 3D printer for education",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 50442,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Technische Universität Berlin",
        "id": 17,
        "name": "Jérémy Bonvoisin"
      }
    ],
    "description": "Based on the analysis of more than 70 significant open source product development projects, this contribution intends to give an overview of the current state of this emerging practice. The following questions will be particularly addressed:  - How projects use the public space offered by the internet and the existing sharing online platforms in order to stimulate attention and contributions from online communities?  - What are the gaps between actual practices and best practices formulated by the open source hardware association?  - What do these gaps reveal about the intention of open source product development projects?  - What different types of open source product development projects can be characterized? This research is lead in the context of the French-German project \"OPEN!-Methods and tools for community-based product development\" involving among others the Technische Universität Berlin and the University of Grenoble. This project is aimed at understanding and formalizing the emerging practice of community-based product development and at developing methodological and IT tools in order to support these practices.",
    "title": "Current state of practices in open source hardware",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 57185,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Intelligent Systems / Altran",
        "id": 18,
        "name": "Toon Peters"
      }
    ],
    "description": "picoTCP is an open source TCP/IP stack implementation targetted at embedded devices. Its focusses lie in Modularity, Portability and Quality.  During this talk you'll get introduced to picoTCP",
    "title": "picoTCP",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 34890,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "youbroketheinternet.org",
        "id": 19,
        "name": "carlo von lynX"
      }
    ],
    "description": "It is time to write a new Constitution for the EU. We need a participation platform to do this. There are two kinds of participatory e-democracy. The one that an authority has set-up where you trust them that justice, fairness and democratic correctness will be provided, demagogy and inflammatory behavior be dealt with by trustworthy admins you never heard or saw. And the other one where the participants themselves are empowered to do this. Which approach do you find more appropriate for the task? Has this been done before? What went wrong in past attempts?",
    "title": "Making participation: How to put participants in charge of their own e-democracy platform",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 10890,
    "location": "a",
    "type": "Talk of 25 minutes"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Heart of Code",
        "id": 20,
        "name": "cat spangehl"
      }
    ],
    "description": "We would like to shortly introduce the Heart of Code, a Berlin based hackspace for women*. ",
    "title": "Heart Of Code - a hackspace for women* in Berlin",
    "track": {
      "order": 1,
      "name": "Galerie",
      "id": 1
    },
    "session_id": 37452,
    "location": "a",
    "type": "Lightning Talk (5-10 minutes)"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Syria on the Move, SocialVisions e.V.",
        "id": 21,
        "name": "Jenz Steiner"
      }
    ],
    "description": "More than 4.7 million Syrians have now fled the war and became refugees in other countries. Humanitarian aid is is usefull, but cannot replace civil rights or freedom of speech. The Berlin based independent project \"Syria on the Move\" gives a voice to syrian refugees and helps them to get in touch by establishing a webbased map tool. This allows refugees to upload their pictures, share experiences and comment on issues that really matter to them. ",
    "title": "Connecting Syrian refugees",
    "track": {
      "order": 1,
      "name": "LightingTalks",
      "id": 2
    },
    "session_id": 7791,
    "location": "a",
    "type": "Lightning Talk (5-10 minutes)"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "private",
        "id": 22,
        "name": "Jan / Lisa Dittrich / Conrad"
      }
    ],
    "description": "Applications, algorithms and devices have an intended use – which often is ignored: People use Excel as a database, images to send text, Dropbox to share code… Why don't they use the »right« tools?  Instead of pointing out that the users are wrong we want to show why these »misuses« of systems make sense from the users perspective  nd why the people who use workarounds instead of the »right« tools are  hackers – without knowing it.",
    "title": "In praise of workarounds",
    "track": {
      "order": 1,
      "name": "LightingTalks",
      "id": 2
    },
    "session_id": 112,
    "location": "a",
    "type": "Lightning Talk (5-10 minutes)"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Copertura Label",
        "id": 23,
        "name": "Ivers Yves Pierre"
      }
    ],
    "description": "What is a VC? What are the advantages of VC? What are the desadvantages of VC? Bonus: 5 models to raise money without VC",
    "title": "aising money with Venture Capitalist",
    "track": {
      "order": 1,
      "name": "LightingTalks",
      "id": 2
    },
    "session_id": 98882,
    "location": "a",
    "type": "Lightning Talk (5-10 minutes)"
  },
  {
    "py/object": "models.Session",
    "speakers": [],
    "description": "",
    "title": "",
    "track": {
      "order": 1,
      "name": "LightingTalks",
      "id": 2
    },
    "session_id": 18111,
    "location": "a",
    "type": ""
  },
  {
    "py/object": "models.Session",
    "speakers": [],
    "description": "",
    "title": "",
    "track": {
      "order": 1,
      "name": "LightingTalks",
      "id": 2
    },
    "session_id": 6346,
    "location": "a",
    "type": ""
  },
  {
    "py/object": "models.Session",
    "speakers": [],
    "description": "",
    "title": "",
    "track": {
      "order": 1,
      "name": "LightingTalks",
      "id": 2
    },
    "session_id": 66409,
    "location": "a",
    "type": ""
  },
  {
    "py/object": "models.Session",
    "speakers": [],
    "description": "",
    "title": "",
    "track": {
      "order": 1,
      "name": "LightingTalks",
      "id": 2
    },
    "session_id": 63979,
    "location": "a",
    "type": ""
  },
  {
    "py/object": "models.Session",
    "speakers": [],
    "description": "",
    "title": "",
    "track": {
      "order": 1,
      "name": "LightingTalks",
      "id": 2
    },
    "session_id": 56446,
    "location": "a",
    "type": ""
  },
  {
    "py/object": "models.Session",
    "speakers": [],
    "description": "",
    "title": "",
    "track": {
      "order": 1,
      "name": "LightingTalks",
      "id": 2
    },
    "session_id": 79774,
    "location": "a",
    "type": ""
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "private",
        "id": 24,
        "name": "Jan Dittrich"
      }
    ],
    "description": "Paper Prototyping is an easy-to-use method for creating, developing and testing concepts for applications and websites.   Everybody can work together – no programming skills are needed. If we want to try something new, we don't need to delete code or discuss if the library supports it: just draw and cut out the new feature!  As well we can easily do a usability test with our prototypes to get further input and check if the idea is going into the right direction. ",
    "title": "Workshop Paper Prototyping",
    "track": {
      "order": 1,
      "name": "Workshops",
      "id": 3
    },
    "session_id": 41123,
    "location": "a",
    "type": "Workshop, 2h"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "ownCloud",
        "id": 25,
        "name": "Jos Poortvliet"
      }
    ],
    "description": "Keeping your data to yourself has become harder and harder. Luckily, there is a solution: ownCloud. At the workshops we will learn how to put your data on a server of your choosing while making it available to your devices wherever you are. File sync and share with others, music, picture and video galleries, mail, calendar and contacts apps and lots of more functionality in a modular, open source and easy to use PHP server app. ownCloud offers a web interface to all its functionality as well as access through webdav, CALDAV and CARDDAV, Ampache and through the mobile and desktop clients available for Win/Mac/Linux, Android/iOS/Blackberry and more platforms.   You want it? You can have it. If you don't have a server yet, consider bringing a Raspberry Pi 2, a Banana Pi or a cubietruck with the needed tools (SD card/power/etc). Or bring a laptop, old desktop or your SSH credentials to your VPS or home server and come set up your ownCloud at the OpenTechSummit!   In this workshop you'll be walked through the process and get hands-on help in installing and getting ownCloud up and running on your system.   A quick overview of how it will (most likely) work:   First a quick 'what is ownCloud' introduction. Then everybody (probably in pairs) gets a USB stick, SD card, development board and two network cables. The USB stick has a image to be put on the SD card. Then the Pi can be booted from it, connected to the network. I monitor the network and based on the MAC of the Pi I tell you your IP. From the laptop, you SSH into the Pi and install a web server and ownCloud. From your browser you then go and configure ownCloud.",
    "title": "Let's set up our ownCloud with Jos Poortvliet at the OpenTechSummit",
    "track": {
      "order": 1,
      "name": "Workshops",
      "id": 3
    },
    "session_id": 92519,
    "location": "a",
    "type": "Workshop"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Piradio - Sender Berlin",
        "id": 21,
        "name": "Jenz Steiner"
      }
    ],
    "description": "Audacity is a free and easy to use audio editor. It is almost as easy to use as your old cassette player, if you've ever had one. Within one hour you will pick up the basics that you need in order to produce your own podcast, radio show, mixtape, listening play or wild audio collage. Please bring your own laptop, headphones, if possible: a digital audio recorder or USB-mic and all the necessary cables and cards. You may download the software and the lame codec in advance under audacity.sourceforge.net!",
    "title": "Fast podcast production with audacity",
    "track": {
      "order": 1,
      "name": "Workshops",
      "id": 3
    },
    "session_id": 47604,
    "location": "a",
    "type": "Workshop"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "Altran",
        "id": 26,
        "name": "Toon PETERS"
      }
    ],
    "description": "picoTCP is an open source TCP/IP stack implementation targeted at embedded devices. Its focusses lie in Modularity, Portability and Quality. During this workshop, we’ll learn how to get picoTCP running on a Cortex M3 target. The end goal of the workshop, is to play a network version of the snake game.  Target audience: Experience with C is required   What we’ll bring: * Development boards (Seeeduino Arch Pro) * USB cables * Ethernet cables for the boards * An Ethernet switch * Bootable USB sticks * Source code on a stick * Manuals for the workshop   What you should bring: * Brains ;-) * A laptop that can boot from USB or * A laptop with all the prerequisites installed (I really hope you’ll be running an Ubuntu based system, or I won’t be able to give much support) $ sudo apt-get install ncurses-base $ sudo apt-get install libncurses5-dev $ sudo apt-get -y install lib32z1 lib32ncurses5 lib32bz2-1.0 (we need some extra stuff for 64 bit) Get the cross compiler for your system (https://launchpad.net/gcc-arm-embedded/+download) Extract it in e.g. /usr/local/gcc-arm-none-eabi-4_9-2015q1/ Add compiler to your path (add export PATH=\"$PATH:/usr/local/gcc-arm-none-eabi-4_9-2015q1/bin/\" to your ~/.bashrc file)   We’ll need python too to program the boards: sudo apt-get -y install python sudo apt-get -y install python-pip sudo pip install --pre -U pyocd   Verify installation: $ pyocd-flashtool à should tell you “waiting for a USB device connected” $ arm-none-eabi-gcc –v à should give you the nice versions",
    "title": "Let's get a network version of the snake game running using picoTCP on a Cortex M3",
    "track": {
      "order": 1,
      "name": "Workshops",
      "id": 3
    },
    "session_id": 27717,
    "location": "a",
    "type": "Workshop"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "LPI e.V.",
        "id": 27,
        "name": "Harald Maaßen"
      }
    ],
    "description": "LPI-Prüfung",
    "title": "LPI Zertifizierung",
    "track": {
      "order": 1,
      "name": "Zertifizierung",
      "id": 4
    },
    "session_id": 62679,
    "location": "a",
    "type": "Zertifizierung"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "LPI e.V.",
        "id": 27,
        "name": "Harald Maaßen"
      }
    ],
    "description": "",
    "title": "Mittagspause",
    "track": {
      "order": 1,
      "name": "Zertifizierung",
      "id": 4
    },
    "session_id": 61607,
    "location": "a",
    "type": "Pause"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "organisation": "LPI e.V.",
        "id": 27,
        "name": "Harald Maaßen"
      }
    ],
    "description": "LPI-Prüfung",
    "title": "LPI Zertifizierung",
    "track": {
      "order": 1,
      "name": "Zertifizierung",
      "id": 4
    },
    "session_id": 66984,
    "location": "a",
    "type": "Zertifizierung"
  }
]}